#### Lisa Over
CMPINF 2110<br>
Homework 4: Bob Ross<br>
March 10, 2021

In [34]:
import sys
print(sys.executable)

/Users/lisa/opt/anaconda3/bin/python

In [35]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import seaborn as sns

#### Read in data: tidy data and separate titles data

In [36]:
data_file = 'ross_episodes_tidy.csv'
df_tidy = pd.read_csv( data_file )

In [37]:
df_tidy.head()

   season  episode    feature    artist artist_name artist_relationship
0       1        1     BUSHES  BOB_ROSS    Bob Ross             Himself
1       1        1  DECIDUOUS  BOB_ROSS    Bob Ross             Himself
2       1        1      GRASS  BOB_ROSS    Bob Ross             Himself
3       1        1      RIVER  BOB_ROSS    Bob Ross             Himself
4       1        1       TREE  BOB_ROSS    Bob Ross             Himself

In [38]:
data_file = 'ross_titles.csv'
df_titles = pd.read_csv( data_file )
df_titles.head()

   season  episode                  TITLE
0       1        1  "A WALK IN THE WOODS"
1       1        2         "MT. MCKINLEY"
2       1        3         "EBONY SUNSET"
3       1        4          "WINTER MIST"
4       1        5         "QUIET STREAM"

#### Create paintings entity table with title, season, and episode

In [39]:
df_titles.rename(columns={'TITLE':'title'}, inplace=True)

In [40]:
df_titles['title'] = df_titles['title'].str.replace(r"[\"\',]", '')

In [41]:
df_titles.head()

   season  episode                title
0       1        1  A WALK IN THE WOODS
1       1        2         MT. MCKINLEY
2       1        3         EBONY SUNSET
3       1        4          WINTER MIST
4       1        5         QUIET STREAM

In [42]:
paintings_entity = df_titles[['title','season','episode']].copy()
paintings_entity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 403 entries, 0 to 402
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   title    403 non-null    object
 1   season   403 non-null    int64
 2   episode  403 non-null    int64
dtypes: int64(2), object(1)
memory usage: 9.6+ KB

#### Create artists entity table with artist_name and artist_relationship

In [43]:
artists_entity = df_tidy.groupby(['artist', 'artist_name', 'artist_relationship']).size().reset_index(name='num_rows')

In [44]:
artists_entity.drop(['num_rows'], axis=1, inplace=True)

In [45]:
artists_entity

        artist  artist_name artist_relationship
0     BOB_ROSS     Bob Ross             Himself
1  DIANE_ANDRE  Diane Andre              Friend
2        OTHER        Other             Friends
3   STEVE_ROSS   Steve Ross                 Son

#### Create features entity table with feature_name

In [46]:
features_entity = df_tidy.groupby(['feature']).size().reset_index(name='num_rows')

In [47]:
features_entity.drop(['num_rows'], axis=1, inplace=True)

In [48]:
features_entity

            feature
0       APPLE_FRAME
1   AURORA_BOREALIS
2              BARN
3             BEACH
4              BOAT
..              ...
58            WAVES
59         WINDMILL
60     WINDOW_FRAME
61           WINTER
62      WOOD_FRAMED

[63 rows x 1 columns]

#### Create painting to features link table

In [20]:
features_link = df_tidy[['season','episode','feature']].copy()
features_link.head()

   season  episode    feature
0       1        1     BUSHES
1       1        1  DECIDUOUS
2       1        1      GRASS
3       1        1      RIVER
4       1        1       TREE

In [21]:
features_link.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3190 entries, 0 to 3189
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   season   3190 non-null   int64
 1   episode  3190 non-null   int64
 2   feature  3187 non-null   object
dtypes: int64(2), object(1)
memory usage: 74.9+ KB

In [22]:
missing_feature = features_link.loc[features_link['feature'].isna(), :]
missing_feature.head()

      season  episode feature
824        9       10     NaN
1439      15        4     NaN
2546      26       10     NaN

In [23]:
df_tidy.loc[(df_tidy['season'] == 9) & (df_tidy['episode'] == 10)]

     season  episode feature    artist artist_name artist_relationship
824       9       10     NaN  BOB_ROSS    Bob Ross             Himself

In [24]:
paintings_entity.loc[(paintings_entity['season'] == 9) & (paintings_entity['episode'] == 10)]

             title  season  episode
113  COUNTRY CHARM       9       10

In [25]:
df_tidy.loc[(df_tidy['season'] == 15) & (df_tidy['episode'] == 4)]

      season  episode feature    artist artist_name artist_relationship
1439      15        4     NaN  BOB_ROSS    Bob Ross             Himself

In [26]:
paintings_entity.loc[(paintings_entity['season'] == 15) & (paintings_entity['episode'] == 4)]

                    title  season  episode
185  PEACEFUL REFLECTIONS      15        4

In [27]:
df_tidy.loc[(df_tidy['season'] == 26) & (df_tidy['episode'] == 10)]

      season  episode feature    artist artist_name artist_relationship
2546      26       10     NaN  BOB_ROSS    Bob Ross             Himself

In [28]:
paintings_entity.loc[(paintings_entity['season'] == 26) & (paintings_entity['episode'] == 10)]

                     title  season  episode
334  PURPLE MOUNTAIN RANGE      26       10

In [29]:
features_link = features_link[~features_link['feature'].isnull()]
features_link.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3187 entries, 0 to 3189
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   season   3187 non-null   int64
 1   episode  3187 non-null   int64
 2   feature  3187 non-null   object
dtypes: int64(2), object(1)
memory usage: 99.6+ KB

#### Export tables to CSV

In [30]:
paintings_entity.to_csv('ross_paintings.csv', index=False, na_rep='NULL')

In [31]:
artists_entity.to_csv('ross_artists.csv', index=False, na_rep='NULL')

In [32]:
features_entity.to_csv('ross_features.csv', index=False, na_rep='NULL')

In [33]:
features_link.to_csv('ross_features_link.csv', index=False, na_rep='NULL')